In [1]:
import pandas as pd

# 시계열 데이터
- 시간으로 기록된 데이터를 분석하는데 편리하다
- 특정한 시점을 기록하는 Timestamp
- 두시점사이의 일정한 기간을 나타내는 Period
- Timestamp와 Period로 바꾸면 인덱싱과 슬라이싱이 편리하다.
- Timestamp가 행인덱스가되면, DatetimeIndex라는 고유한 속성으로 변한다.
- Period가 행인덱스가되면, PeriodIndex라는 고유한 속성으로 변한다.

In [2]:
import shutil

In [3]:
# shutil.move('C:/Users/i7B/Downloads/stock-data.csv','stock-data.csv')

## 연습해보기-Timestamp

In [4]:
df=pd.read_csv('stock-data.csv')

In [5]:
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [6]:
df.info

<bound method DataFrame.info of           Date  Close  Start   High    Low  Volume
0   2018-07-02  10100  10850  10900  10000  137977
1   2018-06-29  10700  10550  10900   9990  170253
2   2018-06-28  10400  10900  10950  10150  155769
3   2018-06-27  10900  10800  11050  10500  133548
4   2018-06-26  10800  10900  11000  10700   63039
5   2018-06-25  11150  11400  11450  11000   55519
6   2018-06-22  11300  11250  11450  10750  134805
7   2018-06-21  11200  11350  11750  11200  133002
8   2018-06-20  11550  11200  11600  10900  308596
9   2018-06-19  11300  11850  11950  11300  180656
10  2018-06-18  12000  13400  13400  12000  309787
11  2018-06-15  13400  13600  13600  12900  201376
12  2018-06-14  13450  13200  13700  13150  347451
13  2018-06-12  13200  12200  13300  12050  558148
14  2018-06-11  11950  12000  12250  11950   62293
15  2018-06-08  11950  11950  12200  11800   59258
16  2018-06-07  11950  12200  12300  11900   49088
17  2018-06-05  12150  11800  12250  11800   42485
18  2018-06-04  11900  11900  12200  11700   25171
19  2018-06-01  11900  11800  12100  11750   32062>

In [7]:
# 문자열(object) 데이터를 판다스의 Timestamp로 변환
df['new_date']=pd.to_datetime(df['Date'])

In [8]:
df.head()

         Date  Close  Start   High    Low  Volume   new_date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26

In [9]:
type(df['new_date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [10]:
#기존 Date를 지우고, new_date로 새로운 인덱스를 지정
df.set_index('new_date', inplace=True)

In [11]:
df.head()

                  Date  Close  Start   High    Low  Volume
new_date
2018-07-02  2018-07-02  10100  10850  10900  10000  137977
2018-06-29  2018-06-29  10700  10550  10900   9990  170253
2018-06-28  2018-06-28  10400  10900  10950  10150  155769
2018-06-27  2018-06-27  10900  10800  11050  10500  133548
2018-06-26  2018-06-26  10800  10900  11000  10700   63039

In [12]:
df.drop('Date',axis=1,inplace=True)

In [13]:
df.head()

            Close  Start   High    Low  Volume
new_date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

## 연습해보기-Period

> Period 옵션
- D-1일, W-1주일, M=월말, MS=월초, Q-분기말, QS-분기초, A-연말, AS-연초
- B-휴일제외, H=1시간, T=1분, S-1초, L=1/1000초

In [14]:
dates= ['2019-01-01','2010-03-01','2021-06-01']

In [15]:
ts_dates=pd.to_datetime(dates)

In [16]:
ts_dates

DatetimeIndex(['2019-01-01', '2010-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [17]:
type(ts_dates[0])

pandas._libs.tslibs.timestamps.Timestamp

In [18]:
pr_day=ts_dates.to_period(freq='D')

In [19]:
pr_day

PeriodIndex(['2019-01-01', '2010-03-01', '2021-06-01'], dtype='period[D]', freq='D')

In [20]:
pr_week=ts_dates.to_period(freq='W')

In [21]:
pr_week

PeriodIndex(['2018-12-31/2019-01-06', '2010-03-01/2010-03-07',
             '2021-05-31/2021-06-06'],
            dtype='period[W-SUN]', freq='W-SUN')

In [22]:
pr_month=ts_dates.to_period(freq='M')

In [23]:
pr_month

PeriodIndex(['2019-01', '2010-03', '2021-06'], dtype='period[M]', freq='M')

In [24]:
pr_year=ts_dates.to_period(freq='A')

In [25]:
pr_year

PeriodIndex(['2019', '2010', '2021'], dtype='period[A-DEC]', freq='A-DEC')

-----------------------
## 타임스탬프 배열만들기
- 편리하게 날짜로 이루어진 배열을 만들 수 있다.

In [26]:
ts_ms = pd.date_range(start='2019-01-04', #날짜 범위의 시작
                     end=None, # 날짜 범위의 끝
                     periods=6, # 생서할 Timestamp의 갯수
                     freq='MS', # 빈도옵션(MS=한달간격, 범위내의 월초를 기준으로,)
                     tz='Asia/Seoul') #

In [27]:
ts_ms#MS로 지정했기때문에, 2월부터나옴.

DatetimeIndex(['2019-02-01 00:00:00+09:00', '2019-03-01 00:00:00+09:00',
               '2019-04-01 00:00:00+09:00', '2019-05-01 00:00:00+09:00',
               '2019-06-01 00:00:00+09:00', '2019-07-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [28]:
ts_ms=pd.date_range(start='2019-01-01',
                   periods=6,
                   freq='3M', # M은 범위내의 말일을 기준으로,
                   tz='Asia/Seoul')

In [29]:
ts_ms

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

In [30]:
pr_m = pd.period_range(start='2019-01-01',
                       end=None,
                       periods=3,
                       freq='M')

In [31]:
pr_m

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]', freq='M')

In [32]:
pr_h = pd.period_range(start='2019-01-01',
                       end=None,
                       periods=3,
                       freq='H')

In [33]:
pr_h

PeriodIndex(['2019-01-01 00:00', '2019-01-01 01:00', '2019-01-01 02:00'], dtype='period[H]', freq='H')

In [34]:
pr_h = pd.period_range(start='2019-01-01',
                       end=None,
                       periods=3,
                       freq='2H')

In [35]:
pr_h

PeriodIndex(['2019-01-01 00:00', '2019-01-01 02:00', '2019-01-01 04:00'], dtype='period[2H]', freq='2H')

## 실습해보기

In [36]:
df = pd.read_csv("stock-data.csv")
df['new_date'] = pd.to_datetime(df['Date'])
#df.set_index('new_date', inplace=True)
df.drop('Date', axis=1, inplace=True)
display(df.head())

df['year'] = df['new_date'].dt.year
df['month'] = df['new_date'].dt.month
df['day'] = df['new_date'].dt.day
df['date_yr'] = df['new_date'].dt.to_period(freq='A')
df.head()

   Close  Start   High    Low  Volume   new_date
0  10100  10850  10900  10000  137977 2018-07-02
1  10700  10550  10900   9990  170253 2018-06-29
2  10400  10900  10950  10150  155769 2018-06-28
3  10900  10800  11050  10500  133548 2018-06-27
4  10800  10900  11000  10700   63039 2018-06-26

   Close  Start   High    Low  Volume   new_date  year  month  day date_yr
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2    2018
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29    2018
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28    2018
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27    2018
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26    2018